#非参数的多组数据位置推断
#Kruskal-Wallis单因素方差分析
d <- c(80,203,236,252,284,368,457,393,133,180,100,160,156,295,320,448,465,481,279,194,214,272,330,386,475)
gr <- c(1,1,1,1,1,1,1,1,2,2,2,2,3,3,3,3,3,3,3,4,4,4,4,4,4)
da1 <- c(80,203,236,252)
da2 <- c(133,180,100,160)
da3 <- c(156,295,320,448)
da4 <- c(194,214,272,330)
dat <- data.frame(da1,da2,da3,da4)
kruskal.test(d,gr)
#参数统计的方差分析,其中数据形式必须是数据框，而且数据框要求每一列的长度相同
aov(d~gr,data=dat)

#Jonckheere-Terpstra检验
#library(SAGx)
library(clinfun)
x= c(125,136,116,101,105,109)
y= c(122,114,131,120,119,127)
z= c(128,142,128,134,135,131,140,129)
g=c(rep(1,6),rep(2,6),rep(3,8))
tapply(c(x,y,z),g,median)#计算每一组的中位数
#JT.test(data=t(c(x,y,z)),class=g)
jonckheere.test(t(c(x,y,z)),g)


#Friedman秩方差分析法
b=c(85,82,82,79,87,75,86,82,90,81,80,76,80,75,81,75)
t=c(1,2,3,4,1,2,3,4,1,2,3,4,1,2,3,4)
a=c(1,1,1,1,2,2,2,2,3,3,3,3,4,4,4,4)
friedman.test(b,t,a)
